; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite6 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	infrared0 - mode
	infrared5 - mode
	spectrograph3 - mode
	spectrograph4 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star5 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared5)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 spectrograph3)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared1)
	(supports instrument4 infrared5)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star5)
	(supports instrument5 infrared5)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument7 spectrograph3)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph4)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet8)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph2)
	(supports instrument10 spectrograph3)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star0)
	(supports instrument11 infrared5)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 GroundStation4)
	(on_board instrument9 satellite6)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation1)
	(supports instrument12 infrared1)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument12 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation3)
)
(:goal (and
	(pointing satellite1 Planet6)
	(pointing satellite2 GroundStation1)
	(pointing satellite3 Planet10)
	(pointing satellite4 Star0)
	(pointing satellite5 Star5)
	(pointing satellite6 Planet8)
	(have_image Planet6 infrared0)
	(have_image Star7 infrared1)
	(have_image Star7 spectrograph3)
	(have_image Planet8 infrared0)
	(have_image Planet8 infrared1)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 infrared0)
))

)

; plan
1. (turn_to satellite5 star5 planet8)
   deleted: (pointing satellite5 planet8)
   added: (pointing satellite5 star5)
   goals met: 1 of 13
2. (turn_to satellite4 star0 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 star0)
   goals met: 2 of 13
3. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 2 of 13
4. (calibrate satellite3 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 2 of 13
5. (turn_to satellite3 planet6 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet6)
   goals met: 2 of 13
6. (take_image satellite3 planet6 instrument3 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 3 of 13
7. (turn_to satellite3 phenomenon9 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon9)
   goals met: 3 of 13
8. (turn_to satellite2 groundstation2 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation2)
   goals met: 3 of 13
9. (turn_to satellite1 planet6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet6)
   goals met: 4 of 13
10. (take_image satellite3 phenomenon9 instrument3 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 5 of 13
11. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 5 of 13
12. (calibrate satellite2 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 5 of 13
13. (turn_to satellite2 star7 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star7)
   goals met: 5 of 13
14. (take_image satellite2 star7 instrument2 infrared1)
   added: (have_image star7 infrared1)
   goals met: 6 of 13
15. (take_image satellite2 star7 instrument2 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 7 of 13
16. (turn_to satellite2 groundstation1 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation1)
   goals met: 8 of 13
17. (turn_to satellite3 planet8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet8)
   goals met: 8 of 13
18. (take_image satellite3 planet8 instrument3 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 9 of 13
19. (take_image satellite3 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 10 of 13
20. (turn_to satellite3 planet10 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet10)
   goals met: 11 of 13
21. (take_image satellite3 planet10 instrument3 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 12 of 13
22. (turn_to satellite6 planet8 groundstation1)
   deleted: (pointing satellite6 groundstation1)
   added: (pointing satellite6 planet8)
   goals met: 13 of 13
